//6.编程题 
//题目名称:
//计算求和题目内容:
//求Sn=a+aa+aaa+aaaa+aaaaa的前5项之和，其中a是一个数字，例如:2+22+222+2222+22222
#include<math.h>
#include<stdio.h>
//int main()
//{
//	int a=0;
//	int b=0;	
//	scanf("%d%d",&a,&b);
//	int sum = 0;
//	int ret = 0;
//	int i=0;
//	for(i=0;i<b;i++)
//	{
//		ret=ret*10+a;
//		sum+=ret;
//	} 
//	printf("%d\n",sum);
//	return 0;
//} 



//第7题(编程题)题目名称:
//打印水仙花数
//题目内容:
//求出0～100000之间的所有"水仙花数"并输出。
//"水仙花数"是指一个n位数，其各位数字的n次方之和确好等于该数本身，
//如:153=1^3+5^3+3^3，则153是一个水仙花数”。
//int main()
//{
//	int i = 0;
//	for(i=0;i<100000;i++)
//	{
//		//1.确定位数n
//		int n = 1;
//		int tmp = i;//临时空间tmp 
//		int sum = 0;
//		while(tmp/10)
//		{
//			tmp = tmp/10; 
//			n++;
//		}
//		//2.确认i每一位数n次方的和sum
//		tmp = i;
//		while(tmp)
//		{
//			sum=sum+pow(tmp%10,n);
//			tmp=tmp/10; 
//		}
//		if(sum==i)
//		{
//			printf("%d ",i);
//		} 
//	}
//	return 0;
//} 




//第8题（编程题)题目名称:
//打印菱形
//题目内容:
//用C语言在屏幕上输出以下图案:
//      *
//     ***
//    *****     
//   *******
//  *********
// ***********
//*************
// ***********
//  *********
//   *******
//    *****
//     ***
//      *

//int main()
//{
//	int line = 0;
//	scanf("%d",&line);//7
//	//打印上半部分
//	int i = 0;
//	for(i = 0;i < line;i++)
//	{
//		//打印空格
//		int j = 0;
//		for(j = 0;j < line - 1 - i;j++)
//		{
//			printf(" ");
//		}
//		for(j = 0;j <2 * i + 1 ;j++)
//		{
//			printf("*");
//		}
//		//打印*号 
//		printf("\n"); 
//	} 
//	//打印下半部分
//	for(i = 0;i <line-1 ;i++)
//	{
//		//打印空格
//		int j = 0;
//		for(j = 0;j < i+1;j++)
//		{
//			printf(" ");
//		}
//		for(j = 0;j < 2*(line - 1 - i)-1;j++)//现在不懂 
//		{
//			printf("*");
//		}
//		printf("\n");
//		//打印*号 
//	}
//	return 0;
//}






